app/Controllers/AuthController.php

    public function login()
    {
        if ($this->request->getPost()) {
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');

            $dataUser = $this->user->where(['username' => $username])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'ardiansyah'
 LIMIT 1