app/Controllers/UserController.php

    public function index()
    {
        // Mengambil daftar pengguna dari database
        $userModel = new UserModel();
        $users = $userModel->where('is_aktif', 'false')->findAll();
---
SELECT *
FROM `user`
WHERE `is_aktif` = 'false'

    public function update($userId)
    {
        // Periksa apakah pengguna yang sedang login memiliki peran admin
        if (session()->get('role') === 'admin') {
            // Dapatkan pengguna berdasarkan ID
            $userModel = new UserModel();
            $user = $userModel->find($userId);

            if ($user) {
                $userstatus = $user['is_aktif'] === 'false';

                if ($userstatus) {
                    // Perbarui nilai is_aktif menjadi true
                    $userModel->update($userId, ['is_aktif' => 'true']);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '7'
UPDATE `user` SET `is_aktif` = 'true'
WHERE `user`.`id` IN ('7')